"""
Дано список з чисел та рядків.
Рядки у списку завжди непорожні та складаються тільки з символів 0123456789.
За допомогою функції sorted() отримати копію цього списку:
a) відсортовану за значенням числа елементу.
б) відсортовано за значенням першої цифри числа.
"""

original_list = [5, '9', 0, '452', 6.5, '6', 1, 2]
new_list = sorted(original_list, key=int)
print(new_list)




original_list_1 = [472, 326, 1, '1101000', 9, '20', 863, '0']
new_list_1 = sorted(original_list_1, key=lambda x: str(x)[0])
print(new_list_1)