a = input('Enter text: ')
print(a[2])           #  третій символ рядка
print(a[-2])          #  передостанній символ рядка
print(a[:5])          #  перші п'ять символів рядка
print(a[:-2])         #  весь рядок, крім двох останніх символів
print(a[::2])         #  усі символи з парними індексами
print(a[1::2])        #  усі символи з непарними індексами
print(a[::-1])        #  усі символи у зворотному порядку
print(a[::-2])        #  усі символи рядка через один у зворотному порядку, починаючи з останнього
print(len(a))         #  довжину рядка
